{"podcast_details": {"podcast_title": "Positive Mindset for Entrepreneurs from The Mind Aware", "episode_title": "Entrepreneur", "episode_image": "https://ssl-static.libsyn.com/p/assets/b/3/5/7/b357e3a263fb4d1d/PMFE-Podcast-Graphic-1400x1400-DPI-72.png", "episode_transcript": " The Mindware 865 Hello, hello and welcome to the show. You are listening to Positive Mindset for Entrepreneurs. This is the show where you discover how to leverage the power of mindset to build your business faster. We like that, don't we? I'm Dana Wilde. I am your host and I know you want to leverage the power of mindset. I know you want to do it every day. I know you want to keep it top of mind. So definitely get the Positive Mindset for Entrepreneurs free daily newsletter. You can get it at DanaWilde.com. DanaWilde.com slash mantra, M-A-N-T-R-A. Today we heard from an audience member who wrote in with an issue in their direct sales company and let me just read what came in. By the way, if you want to submit a question to the show, you can do that anytime at DanaWilde.com slash ask Dana. So this person wrote in and said, my direct sales company has made a change recently, which means I will no longer get paid on my team. With the new structure, I don't see any way to make any long term real money. I've decided to leave. I have a lot of energy, desire and ideas for new businesses, but I also feel some anxiousness about how long it will take me to monetize a new business. I'm ready to start building, but I'm not sure what it looks like. I'd like to build an online following. Okay. And then more stuff about her personal life. I will just leave that. I think this gives us the gist of it. So let's dig in because this is a big question. This is basically a question of how do I build a business, which is more that can be contained in a short podcast. However, having said that, I'm going to do my best and address a lot of points here. So the first key talking point I want to address is you said you have energy, desire and ideas. This is huge. You are in a very feel good, enthusiastic place. Stay in that mindset and let's talk some options. So the first obvious option is you could find a different direct sales company. The benefits of doing that is that you know the drill. They take care of a lot of the business pieces, catalogs, products, et cetera. And it's fast cash. Like you can sign up, get the products, start doing parties if it's party plan, especially and start making cash right away. If you decide to go this route, if you find a different direct sales company, then ask them if you can build another business before you even sign up so that you know ahead of time what your options are. A lot of direct sales companies have this idea that even if the business doesn't compete, they don't want you building any other businesses, which straight up has never made any sense to me. That's like saying, Oh, I opened up a bookstore and I can't open up a restaurant next week. Like I don't understand. I've never have understood why you couldn't open up a different business that doesn't compete with it. But make sure you find out and that you're clear on that because you might find that you want to have that freedom to do something else as well. Next ask yourself how all in you really are with the idea of being with another direct sales company, especially after this recent experience, you might be feeling some after shock. You might be feeling a little bit betrayed. You might be feeling like, Oh, I kind of feel like I don't want to go that route where somebody else kind of still has control. And so you may want to make a different choice, but be aware that this is a choice. And if you did find another product and another company that you really liked, they take a lot of the work out of starting a business and you can just jump in and start making money. The next choice that you can consider that most people leaving direct sales consider is some other type of service based offering. That's going to take a little bit of a learning curve, but it's something that you probably have already figured out that you've got skills for. And it can be anything like coaching or content marketing or digital programs, but it can even be like real estate or web design, anything that really puts you at the center of it. And it's service based. So ask yourself what skills have you already accumulated because of your direct sales business? You might be the person who makes amazing graphics or who does really well on social media. Maybe that's your new business. You might be the person who loves coaching people and specifically maybe coaches people around mindset. Maybe that's your new business. So look at the skills you've already accumulated and ask yourself, could I make this a standalone business? If you go this route, the thing I would really caution you on or the thing to think about is don't make an assumption that you can't monetize right away. Sometimes I think people go into any business thinking they need more than they really do to start monetizing. So you see that person who comes into direct sales and they feel like they need to learn every product and get their business cards back from the printers and have a website up and fill out their bio and all of that before they ever talk to any person about their product. The same thing happens with these service type businesses. You probably already have people who would be interested in anything you have to offer. And it's just a matter of talking to those people that you already know, even people from your direct sales business and say, Hey, guess what? I'm doing this now. And you might find you have instant clients right now. So I'm cautioning you to be careful not to assume that it's going to take you longer to make money than it actually is. The other thing, the third choice that you could consider is a physical product. So Etsy, mugs, crafts. The key thing here is follow your bliss. If you love creating something that you can sell, then do that, create that thing, follow your joy, follow your bliss. And again, don't assume that you can't monetize it right away. Obviously, there are more businesses in the world than those three types that I mentioned, but those are the usual ones that people will transition when they leave one direct sales company, they will transition to another one like that. Now the next piece I want to talk with you about is watching out for your stories. I mentioned already the story about monetizing quickly. It's really easy to think that you have to do too much to make money. If you're a little concerned that you've got that going a little anxious about money or a little worried like, Oh my God, I'm going to lose it if I don't make money right away or panic and it's affecting your enthusiasm and energy and desire that I talked about before, then go and get a part time job or go do something that is cash in hand, easy money to make and take an action step to just make that money and have that base. There is no right way to build a business and there is no shame in having the dreaded jail be that everybody talks about anything that you can do to make your next business a success. You do it. You know if it's a feel good for you or not, you will be able to tell if it's a feel good or not, but just be really mindful of that, that you want to keep that energy level high. That also leads into the second quick thing I want to talk about related to stories. Watch out for overwhelm. I know it's really easy when you start looking at all the things that you would have to do to start a new business and all the different pieces and you start going down that rabbit hole and seeing everything you want to do and this happens to most entrepreneurs even after they've been in business for a long time. I can attest to this for myself if I think about it too hard about all the stuff I want to do in my business, I start to feel overwhelmed too. So don't let yourself go there. One foot in front of the other, take those baby steps, follow your happy, stay happy, pay attention to your emotions, pay attention to your thoughts and number one, focus on the little successes that you're having. Every day just make a list in your mind of the little successes you're having. If you keep doing that, they will build and build and build and build and you will soon just see things are unfolding right before your eyes. So really follow your happy one foot in front of the other, all of that good stuff, which of course is my last point as it should be and as it always is. There is nothing more important you can do than to stay focused on the fun, exciting path before you. Enthusiasm is your superpower. Enthusiasm is the thing that will make this happen. So keep focusing on those things that make you feel good. Keep focusing on those things that are going right. Allow yourself to dream and dream big. Allow yourself to just follow your intuition and your gut and do the next thing that you feel like doing and watch where the road leads you and explore and enjoy. And you're going to have so much fun with this. It's so fun to be on a new adventure, isn't it? You get a whole new adventure and you get to design it. You get to do whatever you want to do. Your whole world is open to you now. Isn't that just fantastic? Isn't that such a big feel good? You can be, do or have anything you choose and you've totally got this."}, "podcast_summary": "volence is its so many different ways. For example, if you found a direct sales and you were actually able to make a team to play in, that would be great because you would earn from your team. There are these wonderful people that were on your team that make money on their sales. Awesome! If that's what you're looking for, always first you might want to join another direct sales company and that direct sales company may have different geographies from the one you're with. There", "podcast_guest": "Guest information not found", "podcast_highlights": "_____ yourself or someone you know, or the sister of a friend of yours or ... And let's say your sister. What do you think your sister might like a direct sales company. Say your sister loves the same kind of makeup and has a social network of girlfriends looking for a cosmetic solution. Okay. Great, so actually leave this one right here. Let's scan this mind map and see if we can get a visual picture of how to create more business opportunities. Okay. So if we just"}
